Repository: arc-canada-japan/arc-gui-robot
Catalog: lib/l10n/app_*.arb
Languages: fr, ja

# appTitle
source: ARC Robot
ja: ARC ロボット

# settingsTitle
source: Settings
fr: Paramètres
ja: 設定

# settingsMenu
source: Settings
fr: Paramètres
ja: 設定

source: Dark Mode
fr: Mode sombre
ja: ダークモード

source: Language
fr: Langue
ja: 言語

# errorPkg
source: Error: '{pkg}' package not found.
fr: Erreur : le paquet « {pkg} » est introuvable.
ja: エラー: 「{pkg}」パッケージが見つかりません。

# errorPkgList
source: The following packages were not found:
fr: Les paquet suivants n'ont pas été trouvés :
ja: 次のパッケージが見つかりませんでした:

# errorPkgListTitle
source: Missing ROS Packages
fr: Paquets ROS manquants
ja: 不足しているROSパッケージ

# packagePath
source: Package's Path:
fr: Chemin du paquet :
ja: パッケージのパス：

# packagePathTitle
source: ROS Package Paths
fr: Chemins des paquets ROS
ja: ROSパッケージのパス

# packageInputManually
source: Click to input the path manually
fr: Cliquez pour saisir le chemin manuellement
ja: 手動でパスを入力するにはクリックしてください

# packageInputManuallyTitle
source: Set path for '{pkg}'
fr: Définir le chemin pour « {pkg} »
ja: '{pkg}' のパスを設定

# packagePathNoOverwrite
source: Do not overwrite path values at startup
fr: Ne pas écraser les chemins au démarrage
ja: 起動時にパスの値を上書きしない

# sourceSystem
source: Found via system
fr: Trouvé via le système
ja: システムから検出されました

# sourcePrefs
source: Loaded from saved settings
fr: Chargé depuis les paramètres
ja: 保存された設定から読み込みました

# sourceMissing
source: Not found
fr: Non trouvé
ja: 見つかりませんでした

# packagePathNoOverwriteTooltip
source: Use previously saved paths instead of checking the system at startup (the missing path will still be checked).
fr: Utiliser les chemins enregistrés au lieu de vérifier le système au démarrage (les chemins manquants seront tout de même vérifiés).
ja: 起動時にシステムをチェックする代わりに保存されたパスを使用します（見つからないパスは引き続きチェックされます）。

# parametersSavedTitle
source: Parameters saved
fr: Paramètres enregistrés
ja: パラメータが保存されました

source: Description:
ja: 説明：

source: Parameters
fr: Paramètres
ja: パラメータ

# saveParametersButton
source: Save the new parameters
fr: Enregistrer les nouveaux paramètres
ja: 新しいパラメータを保存

# noParameters
source: No parameters to display, please make a choice.
fr: Aucun paramètres à afficher, veuillez faire un choix.
ja: 表示するパラメータがありません。選択してください。

# noPathButtonTooltip
source: Impossible to install without the path
fr: Impossible d'installer sans le chemin du paquet
ja: パスが指定されていないため、インストールできません

# installButtonTooltip
source: Open the install wizard
fr: Ouvrir l'assistant d'installation
ja: インストールウィザードを開く

source: No selection
fr: Pas de sélection
ja: 選択なし

source: Advanced Settings
fr: Paramètres avancés
ja: 詳細設定

# rosPath
source: Path of the ROS2 executable
fr: Chemin de l'exécutable ROS2
ja: ROS2 実行ファイルのパス

# rosPathTooltip
source: If ROS2 is already installed in your system PATH you can only write 'ros2', otherwise you should indicate the full path.
fr: Si ROS2 est déjà dans votre variable d'environnement PATH, vous pouvez simplement écrire 'ros2'. Sinon, indiquez le chemin complet.
ja: ROS2 がすでにシステムの PATH に含まれている場合は 'ros2' とだけ記述できます。それ以外の場合はフルパスを指定してください。

# robotTitle
source: Robot
ja: ロボット

# robotMenu
source: Robot
ja: ロボット

# selectRobotList
source: Select a robot
fr: Sélectionnez un robot
ja: ロボットを選択してください

# errorNoRobotListPath
source: The path to the robot controllers is not defined. Impossible to get the robot list.
fr: Le chemin vers les contrôleurs de robots n'est pas défini. Impossible d'obtenir la liste des robots.
ja: ロボットコントローラーへのパスが定義されていません。ロボットリストを取得できません。

# errorNoRobotList
source: The path doesn't exist or no robot controllers have been found.
fr: Le chemin n'existe pas ou aucun contrôleur de robot n'a été trouvé.
ja: パスが存在しないか、ロボットコントローラーが見つかりませんでした。

# pleaseSelectRobot
source: Please select a robot
fr: Veuillez sélectionner un robot
ja: ロボットを選択してください

# installRobotButton
source: Install a robot
fr: Installer un robot
ja: ロボットをインストール

# communicationTitle
source: Communication Interface
fr: Interface de Communication
ja: 通信インターフェース

# communicationMenu
source: Communication
ja: 通信

# selectCommunicationList
source: Select a communication interface
fr: Sélectionnez une interface de communication
ja: 通信インターフェースを選択してください

# errorNoCommunicationListPath
source: The path to the communication interfaces is not defined. Impossible to get the interface list.
fr: Le chemin vers les interfaces de communication n'est pas défini. Impossible d'obtenir la liste.
ja: 通信インターフェースへのパスが定義されていません。リストを取得できません。

# errorNoCommunicationList
source: The path doesn't exist or no communication interfaces have been found.
fr: Le chemin n'existe pas ou aucune interface de communication n'a été trouvée.
ja: パスが存在しないか、通信インターフェースが見つかりませんでした。

# pleaseCommunicationRobot
source: Please select an interface
fr: Veuillez sélectionner une interface
ja: インターフェースを選択してください

# installCommunicationButton
source: Install an interface
fr: Installer une interface
ja: インターフェースをインストール

# videoTitle
source: Video Streaming Protocol
fr: Protocole de Streaming Vidéo
ja: 映像ストリーミングプロトコル

# videoMenu
source: Video
fr: Vidéo
ja: 映像

# selectVideoList
source: Select a video streaming protocol
fr: Sélectionnez un protocole de streaming vidéo
ja: 映像ストリーミングプロトコルを選択してください

# errorNoVideoListPath
source: The path to the video streaming protocols is not defined. Impossible to get the protocol list.
fr: Le chemin vers les protocoles vidéo n'est pas défini. Impossible d'obtenir la liste.
ja: 映像プロトコルへのパスが定義されていません。リストを取得できません。

# errorNoVideoList
source: The path doesn't exist or no video streaming protocols have been found.
fr: Le chemin n'existe pas ou aucun protocole de streaming vidéo n'a été trouvé.
ja: パスが存在しないか、映像ストリーミングプロトコルが見つかりませんでした。

# pleaseVideoRobot
source: Please select a protocol
fr: Veuillez sélectionner un protocole
ja: プロトコルを選択してください

# installVideoButton
source: Install a protocol
fr: Installer un protocole
ja: プロトコルをインストール

# intentionTitle
source: Intention Estimation Algorithm
fr: Algorithme d'Estimation d'Intention
ja: 意図推定アルゴリズム

# intentionMenu
source: Intention
ja: 意図

# selectIntentionList
source: Select an intention estimation algorithm
fr: Sélectionnez un algorithme d'estimation d'intention
ja: 意図推定アルゴリズムを選択してください

# errorNoIntentionListPath
source: The path to the intention estimation algorithms is not defined. Impossible to get the algorithm list.
fr: Le chemin vers les algorithmes d'intention n'est pas défini. Impossible d'obtenir la liste.
ja: 意図推定アルゴリズムへのパスが定義されていません。リストを取得できません。

# errorNoIntentionList
source: The path doesn't exist or no intention estimation algorithms have been found.
fr: Le chemin n'existe pas ou aucun algorithme d'intention n'a été trouvé.
ja: パスが存在しないか、意図推定アルゴリズムが見つかりませんでした。

# pleaseIntentionRobot
source: Please select an algorithm
fr: Veuillez sélectionner un algorithme
ja: アルゴリズムを選択してください

# installIntentionButton
source: Install an algorithm
fr: Installer un algorithme
ja: アルゴリズムをインストール

# launchTitle
source: Launch the Teleoperation
fr: Démarrer la téléopération
ja: テレオペレーションを開始

# launchMenu
source: Launch
fr: Démarrer
ja: 開始

# selectedParametersSubTitle
source: Selected parameters
fr: Paramètres sélectionnés
ja: 選択されたパラメータ

# logSubtitle
source: Log
ja: ログ

# logAllTab
source: All
fr: Tous
ja: すべて

# launchButton
source: Launch
fr: Démarrer
ja: 起動

# stopButton
source: Stop
fr: Arrêter
ja: 停止

# exportLogButton
source: Export Log
fr: Exporter les logs
ja: ログをエクスポート

# saveLaunchParametersButton
source: Save the parameters in a file
fr: Enregistrer les paramètres dans un fichier
ja: パラメータをファイルに保存

# loadLaunchParametersButton
source: Load the parameters from a file
fr: Charger les paramètres depuis un fichier
ja: パラメータをファイルから読み込む

# genericTitle
source: Configuration
ja: 構成

# genericMenu
source: Configuration
ja: 構成

# selectGenericList
source: Select an item
fr: Sélectionnez un élément
ja: 項目を選択してください

# errorNoGenericListPath
source: The path to the configuration files is not defined. Impossible to get the list.
fr: Le chemin vers les fichiers de configuration n'est pas défini. Impossible d'obtenir la liste.
ja: 構成ファイルへのパスが定義されていません。リストを取得できません。

# errorNoGenericList
source: The path doesn't exist or no configurations have been found.
fr: Le chemin n'existe pas ou aucune configuration n'a été trouvée.
ja: パスが存在しないか、構成ファイルが見つかりませんでした。

# pleaseSelectGeneric
source: Please select an item
fr: Veuillez sélectionner un élément
ja: 項目を選択してください

# installGenericButton
source: Install an item
fr: Installer un élément
ja: 項目をインストール

# packageInputManuallyHint
source: /path/to/package
fr: /chemin/vers/le/paquet
